{
  "backend/main.mo": "Motoko canister implementing user profiles and per‑principal backpack item management with authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components and utilities.",
  "frontend/index.css": "Tailwind base styles with custom OKLCH color tokens and dark mode variables.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, and backpack initialization flow.",
  "frontend/src/components/auth/LoginButton.tsx": "Auth button handling Internet Identity login/logout with query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog prompting authenticated users to enter and save their profile name.",
  "frontend/src/components/layout/AppShell.tsx": "Layout wrapper providing header, footer, background pattern, and authentication UI.",
  "frontend/src/features/backpack/BackpackPage.tsx": "Main backpack page that loads user items, applies search and sort, and displays forms, lists, and panels within the app shell.",
  "frontend/src/features/backpack/components/BackpackErrorState.tsx": "Shows an error card with the message and a retry button when backpack data fails to load.",
  "frontend/src/features/backpack/components/BackpackLoadingState.tsx": "Displays skeleton placeholders for the backpack page while data is loading.",
  "frontend/src/features/backpack/components/DeleteItemDialog.tsx": "Confirmation dialog that deletes an item using a mutation and shows success or error toasts.",
  "frontend/src/features/backpack/components/EditItemDialog.tsx": "Dialog for editing an existing item with validation and update mutation handling.",
  "frontend/src/features/backpack/components/HelpPanel.tsx": "Help dialog containing instructions and accordion sections explaining how to use the digital backpack.",
  "frontend/src/features/backpack/components/ItemForm.tsx": "Form to create new backpack items with validation and create-item mutation.",
  "frontend/src/features/backpack/components/ItemList.tsx": "Renders the list of items with empty and filtered states displayed in a card.",
  "frontend/src/features/backpack/components/ItemRow.tsx": "Single item row showing item info with edit and delete dialog controls.",
  "frontend/src/features/backpack/components/ListControls.tsx": "Search and sort controls for backpack items using input and select UI components.",
  "frontend/src/features/backpack/components/SummaryCards.tsx": "Displays total item count, quantity, and weight in three summary cards.",
  "frontend/src/features/backpack/state/listControls.ts": "Applies search filtering and sorting by name or quantity to a list of backpack items.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch and save the current user's profile via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context and login/logout handling using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for listing, creating, updating, deleting, and initializing backpack items.",
  "frontend/src/index.css": "Tailwind base styles and custom warm-toned CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL or session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Project state metadata describing the Digital Backpack app, its features, image requirements, and pending backend feature requests."
}