{
  "backend/main.mo": "IC canister with access control, user profiles, and CRUD backpack item management per principal.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference or tooling.",
  "frontend/index.css": "Tailwind base and theme variables defining the app's color system and global styles.",
  "frontend/index.html": "HTML entry page containing the root div and script loader for the frontend app.",
  "frontend/src/App.tsx": "Main React entry component handling authentication, profile flow, and routing to the backpack UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button for login/logout with II and query cache reset.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog for first‑time profile creation with name input and save action.",
  "frontend/src/components/layout/AppShell.tsx": "App layout wrapper with header, branding, welcome text, and footer.",
  "frontend/src/features/backpack/BackpackPage.tsx": "Backpack dashboard page combining summary stats, item form, list controls, and item list with filtering.",
  "frontend/src/features/backpack/components/BackpackErrorState.tsx": "Displays an error message and retry button when the backpack fails to load.",
  "frontend/src/features/backpack/components/BackpackLoadingState.tsx": "Shows skeleton placeholders while backpack data is loading.",
  "frontend/src/features/backpack/components/DeleteItemDialog.tsx": "Confirmation dialog for deleting an item, triggering a delete mutation and showing status feedback.",
  "frontend/src/features/backpack/components/EditItemDialog.tsx": "Dialog for editing an item with form fields, validation, and an update mutation.",
  "frontend/src/features/backpack/components/HelpPanel.tsx": "Help dialog explaining how to use the Digital Backpack, with accordion-based instructions.",
  "frontend/src/features/backpack/components/ItemForm.tsx": "Form for adding new items with validation and a create-item mutation.",
  "frontend/src/features/backpack/components/ItemList.tsx": "Displays backpack items or empty/filtered states, rendering each item via ItemRow.",
  "frontend/src/features/backpack/components/ItemRow.tsx": "Renders a single item row with edit and delete actions and corresponding dialogs.",
  "frontend/src/features/backpack/components/ListControls.tsx": "Search and sort controls for filtering and ordering the item list.",
  "frontend/src/features/backpack/components/SummaryCards.tsx": "Displays three summary cards showing total items, total quantity, and total weight based on provided backpack items.",
  "frontend/src/features/backpack/state/listControls.ts": "Filters items by search query and sorts them by name or quantity.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries when the actor changes.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Provides hooks to fetch and save the current user's profile using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for managing Internet Identity authentication and state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations and initialization of backpack items via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines light/dark theme color variables using an earthy palette.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Defines project metadata, image requirements, and existing features for the Digital Backpack app; contains no source logic."
}