{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Digital Backpack: fix TS build and add required generated assets",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix React entry component import order and React usage so the frontend TypeScript build succeeds",
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` compiles under TypeScript/ESLint rules used by the project (no imports after executable code / after export).",
        "`dfx deploy` (or the platform build step) completes without frontend compile errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Move the React import to the top of the module (before any exports) and ensure React APIs are referenced via valid imports (e.g., import React or import useEffect) so there are no imports after the default export and the file passes TS/ESLint compilation."
        },
        {
          "path": "frontend/src/components/layout/AppShell.tsx",
          "operation": "modify",
          "description": "Ensure React types used in props (e.g., React.ReactNode) are correctly available under the project's TS settings by adding an appropriate React type import at the top, preventing build failures related to missing React namespace."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add required generated static images to frontend/public/assets/generated with the exact filenames used by the UI",
      "acceptanceCriteria": [
        "The following files exist at `frontend/public/assets/generated/`: `backpack-logo.dim_512x512.png`, `backpack-pattern.dim_1600x900.png`, `backpack-icons.dim_512x512.png`.",
        "When loading the unauthenticated landing screen and the authenticated app shell header, the logo and background pattern render (no broken image icons / 404s in the browser network panel)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/backpack-logo.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated backpack logo image asset at this exact path/filename so UI references resolve without 404s."
        },
        {
          "path": "frontend/public/assets/generated/backpack-pattern.dim_1600x900.png",
          "operation": "create",
          "description": "Add the generated background pattern image asset at this exact path/filename so UI background-image references resolve without 404s."
        },
        {
          "path": "frontend/public/assets/generated/backpack-icons.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated category icons sprite image asset at this exact path/filename so any UI references resolve without missing-asset errors."
        }
      ]
    }
  ]
}